org/_portfolio/cljat/proj-cljat.org
#+OPTIONS: toc:nil
#+BEGIN_HTML
---
permalink: /portfolio/cljat/
title: "Cljat Webapp"
layout: single
author_profile: false
excerpt: "A websocket chat web app with Clojure, Clojurescript, Redis and Postgresql"
header:
  teaser: "cljat_portfolio.png"

gallery:
  - url: cljat_gallery_1.png
    image_path: cljat_gallery_1.png
    alt: "placeholder image 1"
  - url: cljat_gallery_2.png
    image_path: cljat_gallery_2.png
    alt: "placeholder image 2"
---
#+END_HTML

I've been working on this toy project to learn Clojure lately fianlly
there is a walking skeleton I can put it out there. 

Here is the live demo running on an EC2 instance: [[http://ec2-52-38-68-204.us-west-2.compute.amazonaws.com:8080][Live Demo]]

{% include gallery %}

Features:
- Realtime messaging with Websocket
- Scalable with Redis' PUB/SUB across web server nodes
- React Clojurescript front-end application with Reagent

Nice to have in the future:
- More powerful messaging protocols
- User profiles features
- Messages history searching support with ElasticSearch or Solr
- API and Native mobile client

I'll be sharing some things I've leant while working on this project
in this [[http:/dev/portfolio/cljat-details/][Post]]
